package Overload;
/*
    方法重载：
        1、方法重载又被称为：Overload
        2、什么时候考虑使用方法重载
            * 功能相似的时候，尽可能让方法名相同。
            【但是：功能不同/不想死的时候，尽可能让方法名不同】
        3、什么条件满足之后构成了方法重载？
            * 在同一个类当中
            * 方法名相同
            * 参数列表不同：
                - 数量不同
                - 顺序不同
                - 类型不同
        4、方法重载和什么有关系？和什么没有关系？
            * 方法重载和方法名+参数列表有关系
            * 方法重载和返回值类型无关
            * 方法重载和修饰符列表无关
 */

public class Overload02 {
    public static void main(String[] args) {

    }
}
